package com.hillel.qa.java.branching.homework;

public class HomeWork3 {
    /**
     * <h1>Вимоги</h1>
     * <p style="font-size:12px">
     * 1. Оплата за товар проводитиметься способами:
     * <br>
     * - готівкою, додаткова комісія не стягується;
     * <br>
     * - карткою, стягується додаткова комісія 2% від суми купівлі.
     * <br>
     * - за рахунком, стягується додаткова комісія 5% від суми купівлі.
     * <br>
     * 2. Сума купівлі (призначити самостійно) сплачена карткою.
     * <br>
     * 3. Виведіть суму для оплати (сума купівлі з урахуванням суми комісії).
     * <br>
     * 4. Врахуйте варіанти виведення, коли немає відповідності будь-якому способу оплати.
     * <br>
     * 5. Завдання необхідно виконати за допомогою switch case
     * </p>
     */
    public static void main(String[] args) {
        final int suma = 200;
        int oplata = 2;
        switch (oplata) {
            case 1:
                System.out.println("З вас "+suma+"оплата готівкою");
                break;
            case 2:
                int a1= suma*2/100;
                int b1= suma +a1;
                System.out.println("З вас "+b1 +" стягується додаткова комісія 2% за оплату карткою");
                break;
            case 3:
                int a2= suma*5/100;
                int b2= suma +a2;
                System.out.println("З вас "+b2+" стягується додаткова комісія 5% за оплату рахунком");
                break;
            default:
                System.out.println("Такого способу не існує");
        }
    }
}